## This is the trace of **re**-learning pandas. The resource is from [pandas official docs](https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html)

In [14]:
import os
import pandas as pd
import numpy as np
#print(dir(os))

In [12]:
s = pd.Series([1, 3, 5, np.nan, 6, 8]); s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

### Series is like a list. DataFrame is like a multi array.
### when using DataFrame, set index (rows) and columns just as many as the number of data enteries.
#### when setting index, columns automatically aigns the data by _indexes_.

In [7]:
dates = pd.date_range('20130101', periods=6); dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df = pd.DataFrame(np.random.rand(6,4), index=dates, columns=list('ABCD')); df

                   A         B         C         D
2013-01-01  0.846665  0.252262  0.094288  0.707429
2013-01-02  0.273922  0.063890  0.716702  0.975170
2013-01-03  0.689450  0.044278  0.908136  0.211728
2013-01-04  0.377914  0.006500  0.754263  0.386229
2013-01-05  0.946484  0.820069  0.336454  0.828307
2013-01-06  0.835372  0.837145  0.069486  0.706639

### if you use array, then you have to choose array with 1 element, or array with the number of element as other data length.

In [17]:
df2 = pd.DataFrame(dict(
    A=1.,
    B=pd.Timestamp('20130101'),
    C=pd.Series(1, index=list(range(4)), dtype='float32'),
    D=np.array([3]*4, dtype='int32'),
    E=pd.Categorical(['test', 'train', 'test', 'train']),
    F=['foo', 'bar']*2
)); df2

     A          B    C  D      E    F
0  1.0 2013-01-01  1.0  3   test  foo
1  1.0 2013-01-01  1.0  3  train  bar
2  1.0 2013-01-01  1.0  3   test  foo
3  1.0 2013-01-01  1.0  3  train  bar

### tab completion for column names(and other attributes) is actumatically enabled.

In [18]:
df2.A

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

In [20]:
df2.head(2)

     A          B    C  D      E    F
0  1.0 2013-01-01  1.0  3   test  foo
1  1.0 2013-01-01  1.0  3  train  bar

In [21]:
df2.tail(2)

     A          B    C  D      E    F
2  1.0 2013-01-01  1.0  3   test  foo
3  1.0 2013-01-01  1.0  3  train  bar

In [26]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [25]:
df1.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [27]:
df.to_numpy()

array([[0.84666453, 0.25226181, 0.09428758, 0.70742894],
       [0.27392196, 0.06388979, 0.71670189, 0.97517022],
       [0.68944993, 0.04427842, 0.90813565, 0.2117278 ],
       [0.37791405, 0.00649997, 0.75426344, 0.38622869],
       [0.94648413, 0.82006931, 0.33645366, 0.8283066 ],
       [0.83537248, 0.83714454, 0.06948649, 0.70663906]])

### beaware that Numpy arrays have one dtype for the entire array, while the pandas DataFrames have one dtype per column. as you can see the result below, all dtype ends up being 'object' istead of each dtype in DataFrames.

In [29]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-01 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-01 00:00:00'), 1.0, 3, 'train', 'bar'],
       [1.0, Timestamp('2013-01-01 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-01 00:00:00'), 1.0, 3, 'train', 'bar']],
      dtype=object)

In [30]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.661635  0.337357  0.479888  0.635917
std    0.274646  0.389919  0.361234  0.284430
min    0.273922  0.006500  0.069486  0.211728
25%    0.455798  0.049181  0.154829  0.466331
50%    0.762411  0.158076  0.526578  0.707034
75%    0.843842  0.678117  0.744873  0.798087
max    0.946484  0.837145  0.908136  0.975170

In [32]:
df2.T # Transposing DataFrames is pretty easy.

,0,1,2,3
A,1,1,1,1
B,2013-01-01 00:00:00,2013-01-01 00:00:00,2013-01-01 00:00:00,2013-01-01 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train
F,foo,bar,foo,bar

### Sort

In [39]:
df3 = pd.DataFrame(dict(
    A=1.,
    B=pd.date_range('20130101', periods=4),
    C=pd.Series(np.random.rand(4), index=list(reversed(range(4))), dtype='float32'),
    D=np.array(list(range(0,16, 4)), dtype='int32'),
    E=pd.Categorical(['test', 'train', 'test', 'train']),
    F=['foo', 'bar']*2
)); df3

     A          B         C   D      E    F
3  1.0 2013-01-01  0.451181   0   test  foo
2  1.0 2013-01-02  0.327550   4  train  bar
1  1.0 2013-01-03  0.193082   8   test  foo
0  1.0 2013-01-04  0.481651  12  train  bar

In [44]:
df3.sort_index(axis=1, ascending=False) # when sorting by columns orders, set axis = 1

     F      E   D         C          B    A
3  foo   test   0  0.451181 2013-01-01  1.0
2  bar  train   4  0.327550 2013-01-02  1.0
1  foo   test   8  0.193082 2013-01-03  1.0
0  bar  train  12  0.481651 2013-01-04  1.0

In [47]:
df3.sort_values(by='D', ascending=False) # sort by values.

     A          B         C   D      E    F
0  1.0 2013-01-04  0.481651  12  train  bar
1  1.0 2013-01-03  0.193082   8   test  foo
2  1.0 2013-01-02  0.327550   4  train  bar
3  1.0 2013-01-01  0.451181   0   test  foo

### selection 

#### .at, .iat, .loc, .iloc

In [82]:
df3[0:2] # python slicing returns rows values.

     A          B         C  D      E    F
3  1.0 2013-01-01  0.451181  0   test  foo
2  1.0 2013-01-02  0.327550  4  train  bar

In [80]:
df3['B'] # Selection by Python like scripting. (colums slicing?)

3   2013-01-01
2   2013-01-02
1   2013-01-03
0   2013-01-04
Name: B, dtype: datetime64[ns]

In [56]:
df['20130101':'20130102'] # selection by index. this exmaple selection by date

                   A         B         C         D
2013-01-01  0.846665  0.252262  0.094288  0.707429
2013-01-02  0.273922  0.063890  0.716702  0.975170

In [59]:
dates[0]

Timestamp('2013-01-01 00:00:00', freq='D')

In [65]:
df.loc[dates[0]] #selecting by label. (lable slicing) # df[dates[0]] >>> an Error, so use .loc

A    0.846665
B    0.252262
C    0.094288
D    0.707429
Name: 2013-01-01 00:00:00, dtype: float64

In [87]:
df3.loc[0] # .loc is the way to select rows. >>> Series object

A                      1
B    2013-01-04 00:00:00
C               0.481651
D                     12
E                  train
F                    bar
Name: 0, dtype: object

In [93]:
#df3.loc[0:1, 0:1] >>> loc is not for "Position slicing", but for "lable slicing"

In [94]:
df3.iloc[0:1, 0:1] # .iloc is for "position slicing"

     A
3  1.0

In [96]:
df3.iloc[[0,2], [1,2,3,4]] # pass lists as positional options.

           B         C  D     E
3 2013-01-01  0.451181  0  test
1 2013-01-03  0.193082  8  test

In [68]:
df3

     A          B         C   D      E    F
3  1.0 2013-01-01  0.451181   0   test  foo
2  1.0 2013-01-02  0.327550   4  train  bar
1  1.0 2013-01-03  0.193082   8   test  foo
0  1.0 2013-01-04  0.481651  12  train  bar

In [78]:
df3.loc[:, ['A','B']] # selecting multiple columns. loc allows set by axes

     A          B
3  1.0 2013-01-01
2  1.0 2013-01-02
1  1.0 2013-01-03
0  1.0 2013-01-04

### DataFrams -> Series -> Scalar
##### Python scripting and slicing, df['A'] >>> all of column A, df[0:3] >>> rows from 0 to 2
##### "Lable slicing" -> .loc, 
##### "Position slicing" -> .iloc()
##### "Lable slicing" getting scalar -> .at (or .loc)
##### "Position slicing" faster way to get scaler -> .iat()

In [81]:
df.loc[dates[0],'A'] # lable slicing

0.8466645301285687

In [98]:
df.at[dates[0],'A'] # lable slicing

0.8466645301285687

In [100]:
df.iat[0,0] # position slicing

0.8466645301285687

### "Boolean indexing"

In [113]:
df["A"]>.5 # You can make series that will be used to index tabular data

2013-01-01     True
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06     True
Freq: D, Name: A, dtype: bool

In [114]:
df[df["A"]>.5]

                   A         B         C         D
2013-01-01  0.846665  0.252262  0.094288  0.707429
2013-01-03  0.689450  0.044278  0.908136  0.211728
2013-01-05  0.946484  0.820069  0.336454  0.828307
2013-01-06  0.835372  0.837145  0.069486  0.706639

In [108]:
df[df>.5] # >>> apply for all data

                   A         B         C         D
2013-01-01  0.846665       NaN       NaN  0.707429
2013-01-02       NaN       NaN  0.716702  0.975170
2013-01-03  0.689450       NaN  0.908136       NaN
2013-01-04       NaN       NaN  0.754263       NaN
2013-01-05  0.946484  0.820069       NaN  0.828307
2013-01-06  0.835372  0.837145       NaN  0.706639

## Adding new column is as simple as walking in the park.

In [137]:
df3=df.copy(); df3

                   A         B         C         D
2013-01-01  0.846665  0.252262  0.094288  0.707429
2013-01-02  0.273922  0.063890  0.716702  0.975170
2013-01-03  0.689450  0.044278  0.908136  0.211728
2013-01-04  0.377914  0.006500  0.754263  0.386229
2013-01-05  0.946484  0.820069  0.336454  0.828307
2013-01-06  0.835372  0.837145  0.069486  0.706639

In [138]:
df3['E'] = list('Hello!');df3 # the new column name comes in "script name"

                   A         B         C         D  E
2013-01-01  0.846665  0.252262  0.094288  0.707429  H
2013-01-02  0.273922  0.063890  0.716702  0.975170  e
2013-01-03  0.689450  0.044278  0.908136  0.211728  l
2013-01-04  0.377914  0.006500  0.754263  0.386229  l
2013-01-05  0.946484  0.820069  0.336454  0.828307  o
2013-01-06  0.835372  0.837145  0.069486  0.706639  !

In [139]:
df3['E'].isin(['l']) # would like to get data where column E has letter 'l'

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04     True
2013-01-05    False
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [140]:
df3[df3['E'].isin(['l'])] # there you go.

                   A         B         C         D  E
2013-01-03  0.689450  0.044278  0.908136  0.211728  l
2013-01-04  0.377914  0.006500  0.754263  0.386229  l

In [189]:
df3.iat[-1, -1] = '?!'; df3 # would like to "SET" the sign of !

                   A         B         C         D   E
2013-01-01  0.846665  0.252262  0.094288  0.707429   H
2013-01-02  0.273922  0.063890  0.716702  0.975170   e
2013-01-03  0.689450  0.044278  0.908136  0.211728   l
2013-01-04  0.377914  0.006500  0.754263  0.386229   l
2013-01-05  0.946484  0.820069  0.336454  0.828307   o
2013-01-06  0.835372  0.837145  0.069486  0.706639  ?!

In [190]:
df4[df4 == 'l'].any(axis=1) # any (axis=1) >>> seradh by row, any(axis=0) >>> search by columns

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04     True
2013-01-05    False
2013-01-06    False
Freq: D, dtype: bool

In [191]:
df4 = df3.copy()
df4 == 'l'

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True
2013-01-05  False  False  False  False  False
2013-01-06  False  False  False  False  False

In [200]:
df4[df4[df4 == 'l'].any(axis=1)] = -df4.loc[:, ['A', 'B', 'C','D']]; df4 
# so you cannot turn string object to negative, need to SET only number here, however...

                   A         B         C         D    E
2013-01-01  0.846665  0.252262  0.094288  0.707429    H
2013-01-02  0.273922  0.063890  0.716702  0.975170    e
2013-01-03  0.689450  0.044278  0.908136  0.211728  NaN
2013-01-04  0.377914  0.006500  0.754263  0.386229  NaN
2013-01-05  0.946484  0.820069  0.336454  0.828307    o
2013-01-06  0.835372  0.837145  0.069486  0.706639   ?!

In [202]:
df4['E'].isnull() 
# so search the NaN data by .isnull() method. this returns only indexs which can be used lable slicing with .loc()

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04     True
2013-01-05    False
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [204]:
df4.loc[df4['E'].isnull(), 'E'] = 'l'; df4 # tadaaa!

                   A         B         C         D   E
2013-01-01  0.846665  0.252262  0.094288  0.707429   H
2013-01-02  0.273922  0.063890  0.716702  0.975170   e
2013-01-03  0.689450  0.044278  0.908136  0.211728   l
2013-01-04  0.377914  0.006500  0.754263  0.386229   l
2013-01-05  0.946484  0.820069  0.336454  0.828307   o
2013-01-06  0.835372  0.837145  0.069486  0.706639  ?!